index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Java/Heroku</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Java/Heroku"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-05-14T17:38-0700"/>
<meta name="author" content="Nicholas Funnell"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="http://nick.gs/orgstyle.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Java/Heroku</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Java/Heroku</h2>
<div class="outline-text-2" id="text-1">


<p>
This project is a testbed to explore writing Java Webapps and hosting them on Heroku.
</p>
<p>
<a href="http://aqueous-refuge-9456.herokuapp.com/">It is currently hosted on Heroku</a>, but it's on the free plan. That means the first request might take a while
as they will put my app to sleep if it gets no traffic for a while.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Endpoints</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>/letters
</li>
<li>/letters?letters=word
  Spells out a word, putting a : in front of every character. Used for forum emoticons
</li>
<li>/test
</li>
<li>/test?name=xxx&amp;age=xxx
  dumps a json object, with correct headers!
</li>
<li>/name
</li>
<li>/name?name=xxx
  print a greeting. Very "Hello World".
</li>
<li>* wildcard
  another "hello world" endpoint
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Tech</h2>
<div class="outline-text-2" id="text-3">


<p>
I started by following the Heroku Java quickstart guide. That explains how to write a simple Java
application that uses Jetty to handle http traffic. I then wrote a few servlets to experiment with.
The whole thing is built and managed by Maven. It's been great so far!
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Problems</h2>
<div class="outline-text-2" id="text-4">


<p>
I am running into a lot of problems with `foreman`. It is not stopping the server correctly.
Java still runs in the background and stays attached to the port. I always have to kill
the process or be lazy and assign a new port then go back and kill a bunch of Java processes
later.
</p>
<p>
A workaround is to use `honcho` and that seems to take care of things.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-05-14T17:38-0700</p>
<p class="author">Author: Nicholas Funnell</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
